__author__ = 'EvgeniiEliseev'
'''
Для добавления новых фигур необходимо наследоваться от абстрактного класса Figure
С помощью метода get_abstract_area можно определить площадь добавленной фигуры без её явного указания
Для определения площади известной фигуры необходимо создать экземпляр класса этой фигуры, передать в качестве аргументов
стороны или радиус фигуры, после чего вызвать метод get_area
Класс Triangle содержит метод is_right, позволяющий определить, является ли треугольник прямоугольным
'''